---
kind: type
id: T:Autodesk.Revit.DB.TagMode
source: html/1e087d7f-aa78-b319-afc6-2d9019d3646d.htm
---
# Autodesk.Revit.DB.TagMode

The modes of tag creation that are supported for IndependentTags.

## Syntax (C#)
```csharp
public enum TagMode
```